xml/request/updateBooking.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:open="http://oss.dbc.dk/ns/openruth">
   <soapenv:Header/>
   <soapenv:Body>
      <open:updateBookingRequest>
         <open:agencyId>?</open:agencyId>
         <open:bookingId>?</open:bookingId>
         <!--Optional:-->
         <open:agencyCounter>?</open:agencyCounter>
         <!--Optional:-->
         <open:bookingNote>?</open:bookingNote>
         <!--Optional:-->
         <open:bookingStartDate>?</open:bookingStartDate>
         <!--Optional:-->
         <open:bookingEndDate>?</open:bookingEndDate>
         <!--Optional:-->
         <open:bookingTotalCount>?</open:bookingTotalCount>
         <!--Optional:-->
         <open:callback>?</open:callback>
         <!--Optional:-->
         <open:outputType>?</open:outputType>
      </open:updateBookingRequest>
   </soapenv:Body>
</soapenv:Envelope>
